{
  "infos": {
    "value": "Gitlab Value Framework",
    "desc": {
      "value": [
        "Version 1.2",
        "Release Date : 2020"
      ]
    },
    "child": [
      {
        "value": "Value Drivers",
        "desc": {
          "value": [
            "These are the things that the prospect is likely proactively looking for or needing.",
            "These are generally revenue, cost, or risk related.",
            "These are top-of-mind customer topics that exist even if GitLab doesn’t.",
            "They could cause a buyer to re-allocate discretionary funds.",
            "They support a value-based conversation (mutually exclusive, collectively exhaustive)."
          ]
        },
        "child": [
          {
            "value": "Increase Operational Efficiencies",
            "desc": {
              "value": [
                "Simplify the software development toolchain to reduce total cost of ownership"
              ]
            },
            "child": [
              {
                "value": "Before",
                "desc": {
                  "value": [
                    "<b>Process</b> - manual; complex",
                    "<b>Tools</b> - don't scale; too many; legacy; custom; homegrow; outages",
                    "<b>People</b> - functional silos; misaligned priorities; working on wrong things; fighting fires; dissatisfied",
                    "<b>Integrations</b> - brittle; complicated"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Negative Consequences",
                "desc": {
                  "value": [
                    "Lower productivity; more rework; slower cycle time",
                    "Toolchain is expensive to license and support",
                    "Poor developer experience; wasted talent; high turnover in engineering",
                    "Product launch delays"
                  ]
                },
                "child": "null"
              },
              {
                "value": "After",
                "desc": {
                  "value": [
                    "<b>Process</b> - simplified, predictable SDLC process; less ramp time; reduced context switching",
                    "<b>Tools</b> - scale with business and developer needs; more complete coverage; no customization",
                    "<b>People</b> - teams are more productive and collaborative",
                    "<b>Integrations</b> - fewer; less complicated"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Positive Business Outcomes",
                "desc": {
                  "value": [
                    "Reduce product development and delivery costs",
                    "Elimination of bottlenecks leads to agility and faster time to market",
                    "Happy developers - attract and retain top talent",
                    "Move engineers from integration and maintenance to value-add activities"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Required Capabilities",
                "desc": {
                  "value": [
                    "Consistent and efficient developer experience across the development lifecycle",
                    "Centralized reporting and visibility across the development lifecycle",
                    "At point of code change, developers can assess and resolve security, compliance and code quality issues",
                    "Solution that automatically scales to match performance and cost demands of the organization",
                    "Public cloud independent; develop in one place, deploy anywhere",
                    "SaaS and/or self-managed"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Metrics",
                "desc": {
                  "value": [
                    "Lower costs (license, FTEs and compute) of development",
                    "Increase developer/team productivity",
                    "Reduce cycle time (lead time)",
                    "Increase <a class=links href=https://about.gitlab.com/handbook/marketing/product-marketing/devops-metrics/#deployment-frequency target=_blank rel=noopener noreferrer>deployment frequency</a>",
                    "Reduce change failure rate",
                    "Reduce MTTR (mean time to recover/restore)",
                    "Improve developer satisfaction and retention"
                  ]
                },
                "child": "null",
                "links": [
                  "<a href=https://about.gitlab.com/handbook/marketing/product-marketing/devops-metrics/#deployment-frequency"
                ]
              },
              {
                "value": "How we do it",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Complete DevOps Platform",
                    "desc": {
                      "value": [
                        "Start with GitLab just on the use case that you need to improve",
                        "Increase developer/team productivity",
                        "Reduce cycle time (lead time)",
                        "Increase deployment frequency",
                        "Reduce change failure rate",
                        "Reduce MTTR (mean time to recover/restore)",
                        "Improve developer satisfaction and retention"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": " Faster cycle time while also improving quality and security",
                    "desc": {
                      "value": [
                        "Single application",
                        "Rapidly innovating platform",
                        "High performance with easy scaling and management",
                        "Increased developer productivity"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Better",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Single Application",
                    "desc": {
                      "value": [
                        "Minimize friction and reduce handoff time between teams by collaborating at the point of code change",
                        "One interface and one login",
                        "One permissions model",
                        "One data store"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Built for Multi-Cloud",
                    "desc": {
                      "value": [
                        "Easily deploy anywhere, especially with Kubernetes",
                        "GitLab CD is seamlessly included in CI, enabling multi-cloud deployments and progressive delivery with easy automation"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Same Experience on Flexible GitLab Hosting Options",
                    "desc": {
                      "value": [
                        "Identical performance and flexibility on SaaS or self-managed (on prem or any cloud service)",
                        "Deploy GitLab to any cloud service"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "High Performance with Easy Scaling and Management",
                    "desc": {
                      "value": [
                        "Highly scalable architecture, powered by extensible YAML instead of plug-ins",
                        "Templated YAML file architecture enables self-service, flexible CI that doesn't require additional resources",
                        "Runners scale based on demand through auto-scaling and parallelizing pipelines",
                        "Distributed - execute runners on any operating system (Mac, Linux, or Windows) or in the cloud at the same time"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Professional Services",
                    "desc": {
                      "value": [
                        "Professional services, available through GitLab or partners, help to optimize your organization's adoption of GitLab, continue to leverage the tools your teams use every day, facilitate your transition to GitLab, and deliver hands-on training to accelerate your team’s adoption."
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Proof Points",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Customer References/Case Studies",
                    "desc": {
                      "value": [
                        "ENT - Goldman Sachs | Problem: Needed to increase developer efficiency and software quality | Solution: GitLab Premium (CI/CD, SCM) | Result: Improved from 2 builds/day to over 1000/day; simplified workflow and simplified administration",
                        "ENT - Jaguar Land Rover | Problem: Slow delivery and release cycles taking 4 to 6 weeks leading to infrequent feedback for developers | Solution: GitLab Premium (CI) | Result: Increased delivery speed from 3-6 weeks to 30 minutes giving teams faster feedback",
                        "ENT - Sopra Steria | Problem: Needed a solution to empower developers and accelerate software efficiency | Solution: GitLab Premium (CI/CD, SCM) | Result: One solution for over 10,000 Users, 6 minutes for a software build, Zero Developer time for CI/CD",
                        "MM - Alteryx | Problem: Legacy developer tools slowed software delivery frequency | Solution: GitLab Ultimate (CI, CD, Security, SCM) | Result: Decreased software builds from over 3 hours to 30 minutes; able to release 9 times a day",
                        "MM  - Worldline | Problem:  Long cycle times and difficulty collaborating between developers | Solution: GitLab Community Edition (SCM, CI) | Result: From 2 weeks to set up a new project to just minutes; 120x increase in code reviews",
                        "SMB - Hotjar |Problem: Hotjar, a growing all-remote company, was looking for an enhanced CI/CD tool to replace Jenkins | Solution: GitLab Silver | Result: Daily deploys increased from 2 to 15, 30% decrease in time to build GitLab CI vs Jenkins, and 50% deployment time saved",
                        "SMB - Wag! | Problem: Slow release process taking over 40 minutes | Solution: GitLab Ultimate (CI, CD) | Result: Release process reduced to 6 minutes; 8 releases per day with built in security; a full deployment pipeline to Amazon Elastic Container Service (ECS)",
                        "SMB - Chorus | Problem: As Chorus.ai was getting established, they wanted to create an efficient build process | Solution: GitLab Ultimate (SCM, CI, DevSecOps) | Result: 6 week production cycles reduced to 1 week, over 100 builds per day. During a recent audit for SOC2  compliance, the auditors said that Chorus had the fastest auditing process they have seen and most of that is due to the capabilities of GitLab",
                        "SMB - Jasper Solutions | Problem: Jasper Solutions needed a platform that offers security, code management, and consistent pipelines in order to create its dynamic tactical edge “DevSecOps in a box | Solution: GitLab Ultimate (SCM, CI, CD) | Result: 30% reduction in cycle time, 25% increase in deployment frequency and 90-95% of projects are on time and on budget"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Industry Awards",
                    "desc": {
                      "value": [
                        "2020 | DevOps.com Best DevOps Solution Provider |GitLab has fundamentally changed the way development, security and ops teams collaborate and build software—helping customers on their DevOps journey in ways no other company can—by providing a single application for the entire DevOps life cycle.",
                        "2020 | GitLab Recognized by 451 Research as a ‘451 Firestarter’ | Its growing breadth of coverage of enterprise CI/CD releases, and its destination as a single home for DevOps tools and components, make it appealing to enterprise teams wary of tool sprawl and complexity",
                        "2019 | IDC Innovators: Tools Supporting Open (Unopinionated) Developer Platforms | Demonstrated either a groundbreaking business model or an innovative new technology or both",
                        "2018 | IDC Innovators: Agile Code Development Technologies | Demonstrated either a groundbreaking business model or an innovative new technology or both",
                        "2019 | Gartner Peer Insights Customers’ Choice - Enterprise Agile Planning Tools | Over 90 peer reviews with a 4.6 rating:  “DevOps without the overhead” , “Simple, Intuitive and efficient DevOps Life Cycle tool”, and “GitLab increases engineering productivity”",
                        "2018 | G2 Crowd Leader | Over 170 public reviews with a 4.4 rating - “Powerful team collaboration tool for managing software development projects”,  “Great self-hosted open-source source control system”, and “efficient, can trace back, easy to collaborate”",
                        "2018 | Gartner Peer Insights Customers’ Choice - Application Release Orchestration | Over 230 peer reviews with a 4.5 rating - “GitLab Makes Development Streamlined”, “One of the best DevOps Lifecycle tools”, and “Excellent Tools For DevSecOps Initiative…”",
                        "2018 | Google Cloud Partner Awards | Innovative Solution in Developer Ecosystem for the tight integration with GKE"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Analyst Reports/Studies",
                    "desc": {
                      "value": [
                        "Forrester | 2020 Total Economic Impact of GitLab | Learn how study respondents improved development and delivery efficiency by over 87%, resulting in over US$23 million in savings, increased revenue by enabling organizations to deploy 12 times as many releases, and how GitLab strengthened quality and security with one complete DevOps solution",
                        "Forrester | Q3 2019 Cloud-Native Continuous Integration Wave - Leader |- GitLab's simple and cohesive approach lands it squarely as a leader. The UI is easy to use, cohesive, and comes integrated with collaborative tools and development tasks at a glance; it was one of the most fluid UIs we evaluated.",
                        "Forrester | Q3 2017 Continuous Integration Wave - Leader | Continuous Integration streamlines and accelerates building and testing developer code, shortening delivery to minutes rather than weeks and months. Continuous integration also automates compliance tasks and improves audibility.",
                        "Gartner | 2019 Enterprise Agile Planning Tools - Visionary | Agile planning tools help scale agile development practices, encourage collaboration and enable faster delivery to respond to customer needs.",
                        "Forrester | 2019 Manage Your Toolchain Before it Manages You | Multiple tools and toolchains create visibility, security and productivity challenges for development and operations teams; “Out-of-the-box” toolchain solutions are seen as a solution; increasing security, revenue and quality.",
                        "Gartner | 2019 Hype Cycle for DevOps | GitLab helped to define the market and is included as a relevant vendor for Toolchain, Toolchain Orchestration and Application Release Orchestration.",
                        "Gartner | 2019 Hype Cycle for Infrastructure and Operations Automation | GitLab helped to define the market and is recognized as a relevant vendor for both Continuous Delivery and Toolchain Orchestration",
                        "Gartner | 2019 Hype Cycle for Application Security | GitLab is recognized as a relevant vendor for Application Monitoring and Protection."
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "GitLab Reports/Studies",
                    "desc": {
                      "value": [
                        "2020 - GitLab ROI Model | Tools to help you document ROI of adopting GitLab: Standardized ROI Model Slides  | Standardized ROI Model Sheet",
                        "2019 Global Developer Report: DevSecOps | Ops teams are 1.8x more likely to believe they get sufficient notice to support the developer side when their DevOps practice is very good. | Visibility and transparency into future work leads to more efficient planning and execution.",
                        " 2018 Developer Report | 86% of developers agree that continuous integration alleviates blockers in the development process. | Enabling automation and continuous integration can increase overall efficiency and velocity."
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Discovery Questions",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Opening Questions (To Establish Credibility and Provide Relevant Insights)",
                    "desc": {
                      "value": [
                        "Thank you for chatting today. I am curious as to why you took this meeting.",
                        "The most common reason organizations like yours contact us is to consolidate their DevOps toolchain to drive operational efficiencies. However, as we get deeper into those discussions, we often find that organizations have a digital transformation initiative. To meet their goals, they need to deliver better products faster and/or they want to ensure their code is tested to reduce risk. Which of these resonates with you? Why?"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Value Driver-Specific Questions (Increase Operational Efficiencies)",
                    "desc": {
                      "value": []
                    },
                    "child": [
                      {
                        "value": "Before/Negative Consequences",
                        "desc": {
                          "value": [
                            "Walk me through how you currently manage your application development and delivery process. What tools do you utilize and how satisfied are you with those tools?",
                            "Describe how you would characterize the developer workflow for this process. How many different tools and screens (browser windows) does the developer have to navigate to in order to do their work? How does this affect their productivity and job satisfaction?",
                            "What integrations does your team manage across the various DevOps tools? What complexities or challenges do these integrations present? Describe the level of effort that is required to maintain these integrations.",
                            "How do you keep your teams up-to-date with the various tools they use? How much do you currently invest in licensing, managing, maintaining and training your teams? ",
                            "Describe the unforeseen delays you are experiencing as you build and deploy your applications. How do you currently mitigate these delays?",
                            "Describe the separate toolchains your organization has in place to develop and deliver your software. What’s the impact on developer experience and productivity?"
                          ]
                        },
                        "child": "null"
                      },
                      {
                        "value": "After/Positive Business Outcomes",
                        "desc": {
                          "value": [
                            "In an ideal world, how would you like your development, security and operations teams to collaborate? Describe the current initiatives to address this.",
                            "If you were to streamline your toolchain, where would you start? What would you want to remain the same?",
                            "In what ways could streamlining your development toolchain impact your ability to deliver projects on time and on budget?",
                            "What percentage of your team’s time is spent on innovation versus on keeping the integrations operational? If most of those people could work on innovation, how would that impact the business?",
                            "Describe how your developer productivity could change if they only had one application to learn and use."
                          ]
                        },
                        "child": "null"
                      },
                      {
                        "value": "Required Capabilities/Metrics",
                        "desc": {
                          "value": [
                            "What do you need to improve the alignment between your development, security and operations teams throughout the DevOps lifecycle?",
                            "What environments/clouds are you currently deploying to? Describe how your tool selection enables you to be efficient in supporting your cloud strategy.",
                            "What capabilities would enable BOTH organizational efficiencies AND developer satisfaction? ",
                            "How would your team benefit if developers had full team visibility on their projects and respective code? ",
                            "Walk me through how you currently track and measure developer satisfaction, productivity and turnover. Where do you think your company would stand in the rankings of ‘great place to be a developer’?"
                          ]
                        },
                        "child": "null"
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "value": "Deliver Better Products Faster",
            "desc": {
              "value": [
                "Accelerate the software delivery process to meet business objectives"
              ]
            },
            "child": [
              {
                "value": "Before",
                "desc": {
                  "value": [
                    "Fragmented processes and tools - multiple tools and toolchains; inefficient integrations",
                    "Frustrated teams - complex processes and tools get in the way of results",
                    "No visibility - siloed teams",
                    "Poor collaboration and communication",
                    "Making mistakes - bugs caught late in development or after shipping to production",
                    "Bottlenecks - waiting for security; compliance; quality checks; manual processes; infrastructure"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Negative Consequences",
                "desc": {
                  "value": [
                    "Poor velocity (i.e., infrequent deploys/releases); lost market share",
                    "Unable to recruit and retain top talent in engineering, security and operations",
                    "Poor business agility; unable to capture new opportunities and get market feedback",
                    "Poor quality; lost customers and revenue"
                  ]
                },
                "child": "null"
              },
              {
                "value": "After",
                "desc": {
                  "value": [
                    "Streamline processes and tools - security and quality without sacrifice, continuous delivery",
                    "Happy developers - modern software development, contributing to the business, quick feedback",
                    "Control and visibility - able to measure and improve cycle time",
                    "Seamless collaboration - digitally dissolve silos, teams aligned to outcomes",
                    "Security and quality shift left - find and resolve bugs early in the lifecycle",
                    "Responsive - more connected to customers/market"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Positive Business Outcomes",
                "desc": {
                  "value": [
                    "Increase market share and revenue",
                    "Attract, retain and enable top talent",
                    "Increase developer productivity and velocity; faster DevOps lifecycle; maintain quality and security standards",
                    "Disrupt the competition; increased innovation; more expansive product roadmap"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Required Capabilities",
                "desc": {
                  "value": [
                    "Ability to work in parallel and not have to wait on other teams",
                    "Centralized reporting and visibility across the lifecycle",
                    "Developers can quickly fix their own problems with immediate and precise pipeline feedback",
                    "Solution that automatically scales to match performance and cost demands of the organization",
                    "Software that makes testing early and often the path of least resistance"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Metrics",
                "desc": {
                  "value": [
                    "Improve revenue, # of customers, and/or market share",
                    "Increase developer/team productivity",
                    "Reduce cycle time (lead time)",
                    "Increase deployment frequency",
                    "Reduce change failure rate",
                    "Reduce MTTR (mean time to recover/restore)"
                  ]
                },
                "child": "null"
              },
              {
                "value": "How We Do It",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": " Complete DevOps Platform ",
                    "desc": {
                      "value": [
                        "GitLab is a complete DevOps platform, delivered as a single application, fundamentally changing the way development, security and ops teams collaborate. The single platform delivers capabilities across DevSecOps SDLC.",
                        "Start with GitLab just on the use case that you need to improve",
                        "Continue using tools you love",
                        "Begin evolution to a single end-to-end experience for all of DevSecOps",
                        "Collaboration, visibility, control and reporting from idea to production",
                        "Improving cycle time from weeks to minutes greatly reduces development costs and time to market while increasing developer productivity and the ability to attract and retain developer talent"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Faster cycle time while also improving quality and security",
                    "desc": {
                      "value": [
                        "Single application",
                        "Rapidly innovating platform",
                        "High performance with easy scaling and management",
                        "Increased developer productivity"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Better",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Single Application",
                    "desc": {
                      "value": [
                        "Minimize friction and reduce handoff time between teams by collaborating at the point of code change",
                        "One interface and one login",
                        "One permissions model",
                        "One data store"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Rapid Innovation",
                    "desc": {
                      "value": [
                        "Open source",
                        "(Extensive) monthly releases"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "High Performance with Easy Scaling and Management:",
                    "desc": {
                      "value": [
                        "Highly scalable architecture, powered by extensible YAML instead of plug-ins",
                        "Templated YAML file architecture enables self-service, flexible CI that doesn’t require additional resources",
                        "Runners scale based on demand through auto-scaling and parallelizing pipelines ",
                        "Distributed - execute runners on any operating system (Mac, Linux, or Windows) in the cloud at the same time"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Increased Developer Productivity",
                    "desc": {
                      "value": [
                        "More time writing code, less time maintaining and waiting for the toolchain"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Professional Services",
                    "desc": {
                      "value": [
                        "Professional services, available through GitLab or partners, help to optimize your organization's adoption of GitLab, continue to leverage the tools your teams use every day, facilitate your transition to GitLab, and deliver hands-on training to accelerate your team’s adoption."
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Proof Points",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Customer References/Case Studies",
                    "desc": {
                      "value": [
                        "ENT - Hemmersbach | Problem: Multiple tools and communication inefficiencies slowed application delivery | Solution: GitLab Ultimate (Agile, CI, CD, SCM) | Result: Increased build speed by 59x; 14.4% improvement in cycle time ",
                        "ENT - Goldman Sachs | Problem: Needed to increase developer efficiency and software quality | Solution:  GitLab Premium (CI/CD, SCM ) | Result: Improved from 2 builds/day to over 1000/day; simplified workflow and simplified administration",
                        "ENT - Axway | Problem: Legacy SCM and complex toolchain limited worldwide collaboration | Solution: GitLab Premium (SCM) | Result: 26x faster release cycle; from annual releases down to every two weeks ",
                        " 2018 Developer Report | 86% of developers agree that continuous integration alleviates blockers in the development process. | Enabling automation and continuous integration can increase overall efficiency and velocity.",
                        "ENT - Ticketmaster | Problem: Slow build process prevented innovation | Solution: GitLab Premium (CI) | Result:  15x faster - from over 2 hours to 8 minute builds; faster releases and better customer experiences (5 star app reviews)",
                        "MM - Paessler AG | Problem: Unstable and fragile developer tools resulted in slow QA cycles and infrequent releases | Solution: GitLab Premium (SCM, CI, CD) | Result: 120x faster QA, 4x more frequent releases ",
                        " 2018 Developer Report | 86% of developers agree that continuous integration alleviates blockers in the development process. | Enabling automation and continuous integration can increase overall efficiency and velocity.",
                        "SMB - iFarm | Problem: Desire to improve code quality and delivery speed with global development team | Solution: GitLab Premium (unknown) | Result: Over 400 hours cut from ‘bug to resolution’ time; 7.5x faster engineering time per bug ",
                        "SMB - Chorus | Problem: As Chorus.ai was getting established, they wanted to create an efficient build process | Solution: GitLab Ultimate (SCM, CI, DevSecOps) | Result: 6 week production cycles reduced to 1 week, over 100 builds per day. During a recent audit for SOC2  compliance, the auditors said that Chorus had the fastest auditing process they have seen and most of that is due to the capabilities of GitLab",
                        "SMB - Jasper Solutions | Problem: Jasper Solutions needed a platform that offers security, code management, and consistent pipelines in order to create its dynamic tactical edge “DevSecOps in a box | Solution: GitLab Ultimate (SCM, CI, CD) | Result: 30% reduction in cycle time, 25% increase in deployment frequency and 90-95% of projects are on time and on budget"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Industry Awards",
                    "desc": {
                      "value": [
                        "2020 | DevOps.com Best DevOps Solution Provider |GitLab has fundamentally changed the way development, security and ops teams collaborate and build software—helping customers on their DevOps journey in ways no other company can—by providing a single application for the entire DevOps life cycle. ",
                        "2020 | GitLab Recognized by 451 Research as a ‘451 Firestarter’ | Its growing breadth of coverage of enterprise CI/CD releases, and its destination as a single home for DevOps tools and components, make it appealing to enterprise teams wary of tool sprawl and complexity",
                        "2019 | Gartner Peer Insights Customers’ Choice - Enterprise Agile Planning Tools | Over 90 peer reviews with a 4.6 rating:  “DevOps without the overhead” , “Simple, Intuitive and efficient DevOps Life Cycle tool”, and “GitLab increases engineering productivity”",
                        "2019 | IDC Innovators: Tools Supporting Open (Unopinionated) Developer Platforms, 2019 | demonstrated either a groundbreaking business model or an innovative new technology or both",
                        "2018  | IDC Innovators: Agile Code Development Technologies, 2018 | demonstrated either a groundbreaking business model or an innovative new technology or both",
                        "2018 | G2 Crowd Leader | Over 170 public reviews with a 4.4 rating - “Powerful team collaboration tool for managing software development projects”,  “Great self-hosted open-source source control system”, and “efficient, can trace back, easy to collaborate”"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Analyst Reports/Studies",
                    "desc": {
                      "value": [
                        "Forrester | 2020 Total Economic Impact of GitLab | Learn how study respondents improved development and delivery efficiency by over 87%, resulting in over US$23 million in savings, increased revenue by enabling organizations to deploy 12 times as many releases, and how GitLab strengthened quality and security with one complete DevOps solution",
                        "Forrester | Q3 2019 Cloud-Native Continuous Integration Wave - Leader |- GitLab's simple and cohesive approach lands it squarely as a leader. The UI is easy to use, cohesive, and comes integrated with collaborative tools and development tasks at a glance; it was one of the most fluid UIs we evaluated.",
                        "Forrester | Q3 2017 Continuous Integration Wave - Leader | Continuous Integration streamlines and accelerates building and testing developer code, shortening delivery to minutes rather than weeks and months. Continuous integration also automates compliance tasks and improves audibility.",
                        "Gartner | 2019 Enterprise Agile Planning Tools - Visionary | Agile planning tools help scale agile development practices, encourage collaboration and enable faster delivery to respond to customer needs.",
                        "Forrester | Q4 2018 Continuous Delivery and Release Automation - Contender | Release automation tools enable faster, higher-quality, more automated software delivery through modeling applications, infrastructure, middleware and their supporting installation processes and dependencies. “GitLab’s release automation is ideal for cloud-native, Kubernetes-centric organizations.",
                        "Forrester | 2018 New Wave Value Stream Management- Strong Performer | Value stream management provides visibility into project planning, health indicators and analytics to remove waste and focus on customer value.",
                        "Gartner | 2019 Hype Cycle for DevOps | GitLab helped to define the market and is included as a relevant vendor for Toolchain, Toolchain Orchestration and Application Release Orchestration.",
                        "Gartner | 2019 Hype Cycle for Infrastructure and Operations Automation | GitLab helped to define the market and is recognized as a relevant vendor for both Continuous Delivery and Toolchain Orchestration.",
                        "Gartner | 2019 Hype Cycle for Application Security | GitLab is recognized as a relevant vendor for Application Monitoring and Protection."
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "GitLab Reports/Studies",
                    "desc": {
                      "value": [
                        "2020 - GitLab ROI Model | Tools to help you document ROI of adopting GitLab: Standardized ROI Model Slides  | Standardized ROI Model Sheet",
                        "2019 Global Developer Report: DevSecOps | 49% of respondents encounter the most delays during the testing stage of the development lifecycle | Automated testing in the CI pipeline accelerates delivery, finding defects earlier.",
                        "2018 Developer Report | The top two sources of project delays were testing (52%) and planning (47%) | Operating in silos prevents visibility, causes delays and rework."
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Discovery Questions",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Opening Questions (To Establish Credibility and Provide Relevant Insights)",
                    "desc": {
                      "value": [
                        "Thank you for chatting today. I am curious as to why you took this meeting.",
                        "The most common reason organizations like yours contact us is to consolidate their DevOps toolchain to drive operational efficiencies. However, as we get deeper into those discussions, we often find that organizations have a digital transformation initiative to deliver better products faster and/or they want to ensure their code is tested to reduce risk. Which of these resonates with you? Why?"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Value Driver-Specific Questions (Deliver Better Products Faster)",
                    "desc": {
                      "value": []
                    },
                    "child": [
                      {
                        "value": "Before/Negative Consequences",
                        "desc": {
                          "value": [
                            "Many of the companies we work with have a “digital transformation” initiative. Describe what this means for your organization. Which business units have input into forming and running it? ",
                            "Describe how you currently manage your application development and delivery process. What tools do you utilize? How do those tools impact the cycle time?  ",
                            "How would you characterize the developer workflow for the application development and delivery process? How many different tools and screens (browser windows) does the developer have to navigate to do their work? How does this affect the speed at which your team is able to complete their work?",
                            "Walk me through the integrations your team manages across the various DevOps tools. How do integration complexities or challenges affect the cycle time for releasing new services/products?",
                            "Describe your level of visibility into various phases of the DevOps lifecycle as work transitions across your toolchain. How do you obtain that visibility? How does using a disparate set of tools affect your team’s ability to collaborate and communicate in a timely and efficient manner?",
                            "Walk me through the top 3 frustrations your team faces in delivering code to production (e.g., rework, error correction, handoff delays, other)."
                          ]
                        },
                        "child": "null"
                      },
                      {
                        "value": "After/Positive Business Outcomes",
                        "desc": {
                          "value": [
                            "How would you and your customers benefit from having confidence in your team’s ability to produce features faster?",
                            "What are you doing today to improve cycle time? Describe how you would like to improve cycle time.",
                            "If you were to streamline your toolchain to improve cycle time, where would you start? What would you like to remain the same? ",
                            "How would your business benefit if it were not constrained by the speed of releasing product changes?  ",
                            "In an ideal world, how would you balance the organization’s need to accelerate cycle time without compromising quality and security?",
                            "Describe how your developer productivity and cycle time could change if you had just one application to learn, access and use.",
                            "Describe the value in tracking individual developer changes across your software delivery lifecycle."
                          ]
                        },
                        "child": "null"
                      },
                      {
                        "value": "Required Capabilities/Metrics",
                        "desc": {
                          "value": [
                            "Walk me through your top 3 ideas to accelerate your organization’s cycle time. ",
                            "Explain to me your company’s vision for cloud strategy. How would that change the way you are developing today? What do you need to change in your current toolchain to support that strategy?",
                            "What other metrics/measurements will you look at to determine whether you have improved your capability to deliver better products faster?",
                            "Describe how you could improve your level of confidence in your team’s ability to ensure security, compliance and quality while accelerating your application development and delivery.",
                            "What tools in your SDLC would need to be coupled or tightly integrated to accelerate your cycle time?"
                          ]
                        },
                        "child": "null"
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "value": "Reduce Security and Compliance Risk",
            "desc": {
              "value": [
                "Simplify processes to comply with internal processes, controls and industry regulations without compromising speed"
              ]
            },
            "child": [
              {
                "value": "Before",
                "desc": {
                  "value": [
                    "Unsatisfying tradeoffs - security and compliance versus speed",
                    "No traceability - unsure who changed what, when and why",
                    "Uncertainty - unable to know whether teams are doing enough early enough",
                    "Lack of visibility - inability to assess risk across the DevOps lifecycle",
                    "Complexity - fragile collection of disparate tools and manual work result in information and process silos",
                    "Periodic crisis - security breaches, audit failures, discovered vulnerabilities"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Negative Consequences",
                "desc": {
                  "value": [
                    "Poor velocity (i.e., infrequent deploys/releases); lost market share",
                    "Unable to recruit and retain top talent in engineering, security and operations",
                    "Poor business agility; unable to capture new opportunities and get market feedback",
                    "Poor quality; lost customers and revenue"
                  ]
                },
                "child": "null"
              },
              {
                "value": "After",
                "desc": {
                  "value": [
                    "Streamline processes and tools - security and quality without sacrifice, continuous delivery",
                    "Happy developers - modern software development, contributing to the business, quick feedback",
                    "Control and visibility - able to measure and improve cycle time",
                    "Seamless collaboration - digitally dissolve silos, teams aligned to outcomes",
                    "Security and quality shift left - find and resolve bugs early in the lifecycle",
                    "Responsive - more connected to customers/market"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Positive Business Outcomes",
                "desc": {
                  "value": [
                    "Increase market share and revenue",
                    "Attract, retain and enable top talent",
                    "Increase developer productivity and velocity; faster DevOps lifecycle; maintain quality and security standards",
                    "Disrupt the competition; increased innovation; more expansive product roadmap"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Required Capabilities",
                "desc": {
                  "value": [
                    "Ability to work in parallel and not have to wait on other teams",
                    "Centralized reporting and visibility across the lifecycle",
                    "Developers can quickly fix their own problems with immediate and precise pipeline feedback",
                    "Solution that automatically scales to match performance and cost demands of the organization",
                    "Software that makes testing early and often the path of least resistance"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Metrics",
                "desc": {
                  "value": [
                    "Improve revenue, # of customers, and/or market share",
                    "Increase developer/team productivity",
                    "Reduce cycle time (lead time)",
                    "Increase deployment frequency",
                    "Reduce change failure rate",
                    "Reduce MTTR (mean time to recover/restore)"
                  ]
                },
                "child": "null"
              },
              {
                "value": "How We Do It",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": " Complete DevOps Platform ",
                    "desc": {
                      "value": [
                        "GitLab is a complete DevOps platform, delivered as a single application, fundamentally changing the way development, security and ops teams collaborate. The single platform delivers capabilities across DevSecOps SDLC.",
                        "Start with GitLab just on the use case that you need to improve",
                        "Continue using tools you love",
                        "Begin evolution to a single end-to-end experience for all of DevSecOps",
                        "Collaboration, visibility, control and reporting from idea to production",
                        "Improving cycle time from weeks to minutes greatly reduces development costs and time to market while increasing developer productivity and the ability to attract and retain developer talent"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Faster cycle time while also improving quality and security",
                    "desc": {
                      "value": [
                        "Single application",
                        "Rapidly innovating platform",
                        "High performance with easy scaling and management",
                        "Increased developer productivity"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Better",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Platform Security",
                    "desc": {
                      "value": [
                        "Protect IP and processes from internal and external threats via one platform running in your preferred secure environment with custom policy enforcement and access controls"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Application Security",
                    "desc": {
                      "value": [
                        "Reduce the risk of application vulnerabilities via SAST, DAST, dependency scanning, container scanning and enforce scanning across 100% of code",
                        "Advanced (Fuzz) testing to find API and unknown vulnerabilities and logic flaws",
                        "Actionable remediation",
                        "Insight from production exploits of cloud-native apps and ability to block attacks"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Policy Compliance",
                    "desc": {
                      "value": [
                        "Enforce a single set of policies across every SDLC process and every line of code for approvals, access control, testing, license management and evidence collection",
                        "Policy enforcement - one app to enforce globally",
                        "End-to-end access control - manage who touches what, when, why",
                        "License management"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Auditability",
                    "desc": {
                      "value": [
                        "A single system of record and policy automation for logging, documenting decisions, user identity, events and tracing to enable reporting and remediation at a much lower cost",
                        "Simple and easy to provide evidence in audits",
                        "Fast and less costly (time, resources)"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Professional Services",
                    "desc": {
                      "value": [
                        "Professional services, available through GitLab or partners, help to optimize your organization's adoption of GitLab, continue to leverage the tools your teams use every day, facilitate your transition to GitLab, and deliver hands-on training to accelerate your team’s adoption."
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Proof Points",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Customer References/Case Studies",
                    "desc": {
                      "value": [
                        "MM  -  Worldline | Problem:  Long cycle times and hard to collaborate between developers | Solution: GitLab Community Edition (SCM, CI)| Result:  From 2 weeks to set up a new project to just minutes; 120x increase in code reviews",
                        "MM - Paessler AG | Problem:  Unstable and fragile developer tools resulted in slow QA cycles and infrequent releases | Solution: GitLab Premium (SCM, CI, CD) | Result: 120x faster QA, 4x more frequent releases ",
                        "SMB - Wag! | Problem: Slow release process taking over 40 minutes | Solution: GitLab Ultimate (CI, CD) | Result: Release process reduced to 6 minutes; 8 releases per day with built-in security; a full deployment pipeline to Amazon Elastic Container Service(ECS)",
                        "SMB - Glympse | Problem: Slow software development and delivery due to expensive and complex developer tool stack | Solution: GitLab Ultimate (Security, Agile, CI, CD, SCM) | Result: Teams over 2x more efficient completing 50 days of work in 21 days; 8x faster - deploys under 30 min from 4 hours; built-in security scanning making the audit process easier",
                        "SMB - Chorus | Problem: As Chorus.ai was getting established, they wanted to create an efficient build process | Solution: GitLab Ultimate (SCM, CI, DevSecOps) | Result: 6 week production cycles reduced to 1 week, over 100 builds per day. During a recent audit for SOC2  compliance, the auditors said that Chorus had the fastest auditing process they have seen and most of that is due to the capabilities of GitLab",
                        "SMB - Jasper Solutions | Problem: Jasper Solutions needed a platform that offers security, code management, and consistent pipelines in order to create its dynamic tactical edge “DevSecOps in a box | Solution: GitLab Ultimate (SCM, CI, CD) | Result: 30% reduction in cycle time, 25% increase in deployment frequency and 90-95% of projects are on time and on budget.",
                        "SMB - HERE Technologies | Problem: Needed a way to  ensure security is not a bottleneck for rapid feature releases | Solution: GitLab Ultimate (SCM, CI, CD) | Result: Shifted security left and empowered developers by alerting them to a weakness as soon as it is possible. ",
                        "SMB - Arctic Engine | Problem: Writing tests by hand is time-consuming and disillusioning - unsure whether a bug is really there, and it can be even harder to find a way to trigger it. | Solution: GitLab Ultimate ( Fuzz testing) | Result: Fast feedback from fuzz testing highlighting potential bugs."
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Industry Awards",
                    "desc": {
                      "value": [
                        "2020 | DevOps.com Best DevOps Solution Provider |GitLab has fundamentally changed the way development, security and ops teams collaborate and build software—helping customers on their DevOps journey in ways no other company can—by providing a single application for the entire DevOps life cycle. ",
                        "2020 | GitLab Recognized by 451 Research as a ‘451 Firestarter’ | Its growing breadth of coverage of enterprise CI/CD releases, and its destination as a single home for DevOps tools and components, make it appealing to enterprise teams wary of tool sprawl and complexity",
                        "2019 | Gartner Peer Insights Customers’ Choice - Enterprise Agile Planning Tools | Over 90 peer reviews with a 4.6 rating:  “DevOps without the overhead”, “Simple, Intuitive and efficient DevOps Life Cycle tool”, and “Secure and Scalable Solution”",
                        "2018 | Gartner Peer Insights Customers’ Choice - Application Release Orchestration | Over 230 peer reviews with a 4.5 rating - “GitLab Makes Development Streamlined”, “One of the best DevOps Lifecycle tools”, and “Excellent Tools For DevSecOps Initiative…”",
                        "2019 | IDC Innovators: Tools Supporting Open (Unopinionated) Developer Platforms, 2019 | Demonstrated either a groundbreaking business model or an innovative new technology or both",
                        "2018  | IDC Innovators: Agile Code Development Technologies, 2018 | Demonstrated either a groundbreaking business model or an innovative new technology or both",
                        "2018 | G2 Crowd Leader | Over 170 public reviews with a 4.4 rating - “Powerful team collaboration tool for managing software development projects”,  “Great self-hosted open-source source control system”, and “efficient, can trace back, easy to collaborate”"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Analyst Reports/Studies",
                    "desc": {
                      "value": [
                        "Gartner | 2020 Magic Quadrant for Application Security Testing | GitLab recognized as a relevant vendor for Application Security Testing.",
                        "Forrester | 2020 Total Economic Impact of GitLab | Learn how study respondents improved development and delivery efficiency by over 87%, resulting in over US$23 million in savings, increased revenue by enabling organizations to deploy 12 times as many releases, and how GitLab strengthened quality and security with one complete DevOps solution",
                        "Forrester | Q3 2019 Cloud-Native Continuous Integration Wave - Leader |- GitLab's simple and cohesive approach lands it squarely as a leader. The UI is easy to use, cohesive, and comes integrated with collaborative tools and development tasks at a glance; it was one of the most fluid UIs we evaluated.",
                        "Forrester | 2019 Manage Your Toolchain Before it Manages You | Multiple tools and toolchains create visibility, security and productivity challenges for development and operations teams; “Out-of-the-box” toolchain solutions are seen as a solution; increasing security, revenue and quality.",
                        "Forrester | Zero Trust Extended Eco-system | Notable vendor in the Zero Trust eXtended Ecosystem. GitLab is included for security automation and orchestration.",
                        "Forrester | 2018 New Wave Value Stream Management- Strong Performer | Value stream management provides visibility into project planning, health indicators and analytics to remove waste and focus on customer value.",
                        "Gartner | 2019 Hype Cycle for Application Security | GitLab recognized as a relevant vendor for Application Monitoring and Protection"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "GitLab Reports/Studies",
                    "desc": {
                      "value": [
                        "2020 - GitLab ROI Model | Tools to help you document ROI of adopting GitLab: Standardized ROI Model Slides  | Standardized ROI Model Sheet",
                        "2019 Global Developer Report: DevSecOps | 50% of developers agree that security vulnerabilities are mostly discovered by the security team after code is merged and in a test environment | Building security into the DevOps pipeline improves overall security.",
                        "2019 Global Developer Report: DevSecOps | Security teams are 3x more likely to discover bugs before code is merged with a good DevOps practice in place | Include security teams in all phases of application delivery - in the same tools as developers"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Discovery Questions",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "Opening Questions (To Establish Credibility and Provide Relevant Insights)",
                    "desc": {
                      "value": [
                        "Thank you for chatting today. I am curious as to why you took this meeting.",
                        "The most common reason organizations like yours contact us is to consolidate their DevOps toolchain to drive operational efficiencies. As we get deeper into those discussions, however, we often find that organizations have a digital transformation initiative to deliver better products faster and/or want to ensure their code is tested to reduce risk. Which of these would you like to focus on in our conversation today?"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "Value Driver-Specific Questions (Reduce Security and Compliance Risk)",
                    "desc": {
                      "value": []
                    },
                    "child": [
                      {
                        "value": "Before/Negative Consequences",
                        "desc": {
                          "value": [
                            "Describe how your organization has approached DevSecOps and “shifting left” for security. What are the top issues that you expect “shifting left” will address? Who else in your organization is impacted by the answers to these questions?  ",
                            "Describe how you currently manage your application development and delivery process. What tools do you utilize? How do you manage security and compliance across these tools?",
                            "Walk me through the integrations your team manages across the various DevOps tools. How does this affect your organization’s ability to ensure security and compliance?",
                            "Describe what you are currently doing today to detect security vulnerabilities during the application development process. Describe the areas you could improve. ",
                            "Many organizations tell us that there is an implicit trade-off between speed and security. Describe how you keep those interests balanced. ",
                            "What percentage of known vulnerabilities in your software get pushed to production? What are you paying in ‘bug bounties’? Explain the impact. ",
                            "Tell me about the number of resources you have in place to ensure you are compliant with the required standards and/or are able to respond to audits (relevant to customer’s industry).",
                            "Describe if and how disruptive your audit process can be on your ability to meet business demands.",
                            "Describe some of the unforeseen costs you are experiencing to fix security issues as you build and deploy your applications. How do you currently mitigate these costs?",
                            "How has your team prioritized the reduction of these risks? What other teams are involved in reducing your organization’s exposure? ",
                            "What percentage of your application code is being scanned for vulnerabilities? What is keeping you from scanning every code change?",
                            "Have you had exploits against code that passed security scans?"
                          ]
                        },
                        "child": "null"
                      },
                      {
                        "value": "After/Positive Business Outcomes",
                        "desc": {
                          "value": [
                            "How would you and your customers benefit if you were able to have complete confidence in your team’s ability to ensure security, compliance and quality in your application development and delivery?",
                            "In an ideal world, how would you like your development, security and operations teams to collaborate?",
                            "How would enhancing your security practices impact your ability to deliver projects on time and on budget?",
                            "If you could work more productively with your CISO, what would that look like and how would that help you do your day job?  ",
                            "Describe how your team’s productivity would change if you were able to easily meet compliance requirements.",
                            "What would be the impact of doing security scans for all changes?"
                          ]
                        },
                        "child": "null"
                      },
                      {
                        "value": "Required Capabilities/Metrics",
                        "desc": {
                          "value": [
                            "What would it take to improve your level of confidence in your team’s ability to ensure security, compliance and quality in your application development and delivery?",
                            "Describe your top 3 initiatives to improve the alignment between your development, security and operations teams throughout the DevOps lifecycle. ",
                            "How are you ensuring developer satisfaction and the business need for security? How do these two interests coexist in your team today?",
                            "Describe how you are providing developers with instantaneous feedback on their code. How would that help new developers get ramped on the code base and company security policies faster?",
                            "How do you currently track and measure the time and effort it takes to resolve identified security vulnerabilities? ",
                            "What metrics/measurements will you look at to determine if you’ve successfully addressed these interests?"
                          ]
                        },
                        "child": "null"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "value": "Differenciators",
        "desc": {
          "value": [
            "They can influence a technical buyer’s decision criteria through Required Capabilities.",
            "Each Differentiator contains a Description, Customer Value, Defensibility and Trap-Setting.",
            "Unique – Not available from any other vendor. Leading products or services that only GitLab can provide.",
            "Comparative – Superior attributes when compared to other companies, often feature or service-based.",
            "Holistic – Attributes of GitLab that would make a customer feel good about doing business with us."
          ]
        },
        "child": [
          {
            "value": "Single Application for Entire DevOps Lifecycle",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Complete DevSecOps platform delivered as a single application",
                    "One interface, one user-model, one data model",
                    "A software ‘factory’ that supports the entire DevOps lifecycle",
                    "Deeply integrated, making developers happier and more efficient",
                    "Centralized collaboration for a wide variety of roles (collaborate without waiting)"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Ship software faster; release new features faster",
                        "Outpace the competition; increased agility to market changes",
                        "More time writing code; less time maintaining the toolchain"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Faster developer onboarding",
                        "Reduce tool acquisition, integration and maintenance costs",
                        "Repurpose/reallocate developers between projects"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Decrease toolchain downtime",
                        "Eliminate error prone toolchain integrations",
                        "Consolidated view of code quality and security to remediate faster"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - Axway | Problem: Legacy SCM and complex toolchain limited worldwide collaboration | Solution: GitLab Premium (SCM) | Result: 26x faster release cycle; from annual releases down to every two weeks ",
                    "ENT - Ticketmaster | Problem: Slow build process prevented innovation | Solution: GitLab Premium (CI) | Result:  15x faster - from over 2 hours to 8 minute builds; faster releases and better customer experiences (5 star app reviews)",
                    "ENT - Goldman Sachs | Problem: Needed to increase developer efficiency and software quality | Solution:  GitLab Premium (CI/CD, SCM) | Result: Improved from 2 builds/day to over 1000/day; simplified workflow and simplified administration",
                    "MM - Alteryx | Problem: Legacy developer tools slowed software delivery frequency | Solution: GitLab Ultimate ( CI, CD, Security, SCM) | Result: Software builds now 30 minutes from over 3 hours; able to release 9 times a day",
                    "Gartner - 2019  | Gartner Peer Insights Customers’ Choice - Enterprise Agile Planning Tools | Over 90 peer reviews with a 4.6 rating: “DevOps without the overhead”, “Simple, Intuitive and efficient DevOps Life Cycle tool”, and “GitLab increases engineering productivity”",
                    "Gartner | 2019 Hype Cycle for DevOps | GitLab helped to define the market and is included as a relevant vendor for Toolchain, Toolchain Orchestration and Application Release Orchestration",
                    "Gartner | 2019 Hype Cycle for Infrastructure and Operations Automation | GitLab helped to define the market and is recognized as a relevant vendor for both Continuous Delivery and Toolchain Orchestration"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Toolchain Complexity. Describe the tools in your current toolchain (draw on whiteboard if possible). What are the main challenges with these tools? How much time do you spend configuring your toolchain for new projects? How many people maintain the toolchain? What would the benefit be of decreasing the number of tools in your toolchain? ",
                    "Trap = Visibility. Tell me how you keep teams aligned and working on the right things at the right times. How many tools do you have to use to understand current status? How long does that take? How does that affect your teams? ",
                    "Trap = Metrics. Walk me through your success metrics in DevOps. How do you measure success or improvement in DevOps? What is your current cycle time? What would the benefit be of being able to measure this?",
                    "Trap = CI/CD Pipeline Problems. How often does your CI/CD pipeline go down and for how long? (How stable has it been?) How many people do you need to alert when it goes down? How many engineers do you have maintaining your CI/CD pipeline and related integrations? What is your process for updating and maintaining your environment? What plug-ins do you use? Describe the impact of these pipeline issues on customers and revenue. If you could change anything about your current CI/CD environment, what would that be and why?",
                    "Trap = Usability. Describe your current onboarding process. How long does it take for you to get a developer up to speed? If your developers could start contributing to code on day one, how would that affect your business? ",
                    "Trap = Auditability. Walk me through your auditing process. How difficult is it for you to pull together audit evidence and proof points across multiple tools? How could you benefit from a faster process? ",
                    "Trap = Application Security. Describe the level of visibility developers have to see vulnerabilities at the point of code commit. How do vulnerabilities found make it back to the accountable developer to resolve? How long does that take? "
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Leading SCM and CI in One Application",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "The backbone of a DevOps toolchain in one application",
                    "Streamlines code review and collaboration",
                    "Start with SCM or CI or both",
                    "One interface, one user-model, one data model",
                    "Interoperable with other tools; continue using tools you love",
                    "Proven enterprise scale"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Ship software faster; release new features faster",
                        "Outpace the competition; increase agility to quickly respond to changes in the market",
                        "More time writing code; less time maintaining the toolchain"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Faster developer onboarding",
                        "Reduce tool acquisition, integration and maintenance costs",
                        "Repurpose/reallocate developers between projects"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Decrease toolchain downtime",
                        "Eliminate error prone toolchain integrations",
                        "Consolidated view of code quality and security to remediate faster",
                        "Move off of legacy tools at your own pace"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - CERN | Problem: Lack of large scale collaboration and visibility | Solution: GitLab Starter (CI) | Result: Over 12,000 users collaborate on GitLab, running 120,000 CI jobs each month",
                    "ENT - Axway | Problem: Legacy SCM and complex toolchain limited worldwide collaboration | Solution: GitLab Premium (SCM) | Result: 26x faster release cycle; from annual releases down to every two weeks ",
                    "MM - Paessler AG | Problem: Unstable and fragile developer tools resulted in slow QA cycles and infrequent releases | Solution: GitLab Premium (SCM, CI, CD) | Result: 120x faster QA, 4x more frequent releases ",
                    "MM - Alteryx | Problem: Legacy developer tools slowed software delivery frequency | Solution: GitLab Ultimate (CI, CD, Security, SCM) | Result: Software builds now 30 minutes from over 3 hours; able to release 9 times a day",
                    "SMB - Glympse | Problem: Slow software development and delivery due to expensive and complex developer tool stack | Solution: GitLab Ultimate (Security, Agile, CI, CD, SCM) | Result: Teams over 2x more efficient completing 50 days of work in 21 days; 8x faster - deploys under 30 min from 4 hours; built-in security scanning making the audit process easier",
                    "Forrester | Q3 2017 Continuous Integration Wave - Leader | Continuous Integration streamlines and accelerates building and testing developer code, shortening delivery to minutes rather than weeks and months. Continuous integration also automates compliance tasks and improve audibility.",
                    "Gartner| 2019 Hype Cycle for DevOps | GitLab helped to define the market and is included as a relevant vendor for Toolchain, Toolchain Orchestration and Application Release Orchestration",
                    "Gartner | 2019 Hype Cycle for Infrastructure and Operations Automation | GitLab helped to define the market and is recognized as a relevant vendor for both Continuous Delivery and Toolchain Orchestration"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Toolchain Complexity. Describe the tools in your current toolchain (draw on whiteboard if possible). What are the main challenges with these tools? How much time do you spend configuring your toolchain for new projects? How many people maintain the toolchain? What would the benefit be of decreasing the number of tools in your toolchain? ",
                    "Trap = SCM to CI Workflow. Describe your current workflow between SCM to CI. How do code reviews get done? When your pipeline fails, what’s the process to remediate? If you could collaborate at the point of change, how would that affect your productivity? When is your next release? How at risk are you for missing that release? At what point does this escalate to higher management? ",
                    "Trap = CI Pipeline Problems. How often does your CI pipeline go down and for how long? (How stable has it been?) How many people do you need to alert when it goes down? How many engineers do you have maintaining your CI pipeline and related integrations? What is your process for updating and maintaining your environment? What plug-ins do you use? Describe the impact of these pipeline issues on customers and revenue. If you could change anything about your current CI environment, what would that be and why?",
                    "Trap = Auditability. Walk me through your auditing process. How difficult is it for you to pull together audit evidence and proof points across multiple tools? How could you benefit from a faster process? ",
                    "Trap = Application Security. Describe the level of visibility developers have to see vulnerabilities at the point of code commit. How do vulnerabilities found make it back to the accountable developer to resolve? How long does that take? "
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Built In Security and Compliance",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Security features out-of-the-box (code scanning, dependency scanning, secrets detection, etc.)",
                    "Automated security testing and audit controls to facilitate policy compliance",
                    "Shift left - move security testing earlier in the development lifecycle; security testing at the point of code commit",
                    "Developers get immediate feedback about new vulnerabilities they introduce",
                    "Enables better collaboration between development and security teams",
                    "One interface, one user-model, one data model for DevSecOps"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Faster time to market due to reduced cycle time for security and compliance workflows",
                        "Increased customer confidence and loyalty"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Vulnerabilities remediated more quickly",
                        "Avoid expensive security fix rework",
                        "Reduced audit costs"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Protect brand reputation",
                        "Deliver secure and compliant code"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "MM - Alteryx | Problem: Legacy developer tools slowed software delivery frequency | Solution: GitLab Ultimate (CI, CD, Security, SCM) | Result: Software builds now 30 minutes from over 3 hours; able to release 9 times a day",
                    "SMB - Wag! | Problem: Slow release process taking over 40 minutes | Solution: GitLab Ultimate (CI, CD) | Result: Release process reduced to 6 minutes; 8 releases per day with built-in security; a full deployment pipeline to Amazon Elastic Container Service (ECS)",
                    "SMB - Glympse | Problem: Slow software development and delivery due to expensive and complex developer tool stack | Solution: GitLab Ultimate (Security, Agile, CI, CD, SCM) | Result: Teams over 2x more efficient completing 50 days of work in 21 days; 8x faster - deploys under 30 min from 4 hours; built-in security scanning making the audit process easier",
                    "Gartner - 2019 | Gartner Peer Insights Customers’ Choice - Enterprise Agile Planning Tools | Over 90 peer reviews with a 4.6 rating:  “Simple, Intuitive and efficient DevOps Life Cycle tool”, and “Secure and Scalable Solution”",
                    "Gartner - 2018 | Gartner Peer Insights Customers’ Choice - Application Release Orchestration | Over 230 peer reviews with a 4.5 rating - “One of the best DevOps Lifecycle tools”, and “Excellent Tools For DevSecOps Initiative…”",
"Forrester | 2019 Wave Software Composition Analysis- Challenger | Software composition analysis tools evaluate applications to uncover vulnerabilities in third party and open source components",
"Gartner | 2019 Hype Cycle for Application Security | GitLab recognized as a relevant vendor for Application Monitoring and Protection"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Collaboration between Development and Security. Tell me about your security testing process. Do you test all of your code changes for security vulnerabilities? When security issues are detected, what’s the process to remediate? How often does development and security disagree on vulnerabilities? When they do disagree, describe the resolution process. What challenges do you have because security and development teams do not have the means to work together closely?",
                    "Trap = Compliance. Walk me through your requirements for security compliance in your development process. What type of coverage do you have? How do you collect the data for security and compliance on a regular basis? When you have a breach, what are the implications and who has to get involved? What type of information is required? How long does it take for your teams to provide audit evidence?",
                    "Trap = Developer rework for Security Fixes. When you have a security issue, how does that affect scheduling and rework? Who is involved and who is impacted? If you could detect and fix security issues sooner, what would that mean for your team’s productivity?",
                    "Trap = Accountability. How often do developers worry about being held responsible for a hack on an app they have created? What type of visibility do they have on vulnerabilities at the point of code commit? How do they find and fix them? How are you ensuring vulnerabilities found make it back to the accountable developer to resolve?"
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Deploy Your Software Anywhere",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Deploy to any environment, any cloud",
                    "Support for GCP, AWS, Azure, OpenShift, VMWare, On Prem, Bare Metal, etc.",
                    "Workflow portability - one deployment workflow regardless of destination"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Faster path to the cloud, resulting in more rapid time to market",
                        "Ability to adopt new technologies from the cloud providers",
                        "Enables business to meet peak time business demands through cloud bursting",
                        "Enables business flexibility and agility; move your workload to best cloud provider "
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Pick your own provider to manage your budget",
                        "Use different clouds for different services",
                        "Enable capacity optimization; cloud bursting for improved costs",
                        "Reduce the costs of lifting and shifting from on-prem to the cloud",
                        "Add modern DevOps practices to your existing infrastructure"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Reduce the technical and operational risk of migrating to the cloud",
                        "Improved availability, performance and redundancy with global cloud deployments ",
                        "Improved resiliency",
                        "Avoid cloud vendor lock-in"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - Ask Media Group | Problem: Difficult to manage the process of building and deploying microservices | Solution: GitLab Premium (CI) | Result: Developers can immediately begin to contribute a new service that can be deployed to AWS as soon as they start  ",
                    "SMB - Trek10 | Problem: Hard to collaborate across silos and with customers on cloud projects | Solution: GitLab Starter (CI) | Result: GitLab and its integrated CI helps seamlessly and securely manage deployments across many AWS accounts",
                    "SMB - Wag! | Problem: Slow release process taking over 40 minutes | Solution: GitLab Ultimate (CI, CD) | Result: Release process reduced to 6 minutes; 8 releases per day with built-in security; a full deployment pipeline to Amazon Elastic Container Service (ECS)",
                    "Gartner | 2019 Hype Cycle for DevOps | GitLab helped to define the market and is included as a relevant vendor for Toolchain, Toolchain Orchestration and Application Release Orchestration",
                    "Gartner | 2019 Hype Cycle for Infrastructure and Operations Automation | GitLab helped to define the market and is recognized as a relevant vendor for both Continuous Delivery and Toolchain Orchestration"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Consistency, Cloud Deploy Environment. How do you deploy apps on premise or to the cloud? How does it differ from how you deploy your cloud apps? What cloud providers do you deploy your applications to today? How are these processes working for you? How much time is that taking your teams? If you could streamline that process, how would your teams benefit? ",
                    "Trap = Cloud Migration. Describe your plans for moving legacy applications to the cloud. What is your timeline? What is the impact of not moving to the cloud? What is keeping you from moving workloads to the cloud? How could your teams benefit from an easier migration to the cloud? ",
                    "Trap = Multi-Cloud. Describe your multi-cloud strategy. What clouds do you deploy to today? Describe the level of risk in being involved with only one cloud provider. If your current provider went down, how would that affect your business? What would be involved in changing or adding a cloud provider? What would be the value of knowing you could facilitate that?"
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Optimized for Kubernetes",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Enables adoption of modern cloud-native development patterns such as microservices and serverless",
                    "Minimizes the Kubernetes learning curve by enabling setup and use of clusters from the GitLab user interface",
                    "Creation (Google) and attachment of Kubernetes clusters  ",
                    "Built-in catalog for installing application and utilities into clusters (using Helm charts)",
                    "Automatic configuration of ephemeral staging environments per committed change (review apps)",
                    "View and manage Kubernetes deployment pod details and logs from the GitLab user interface",
                    "Automatic monitoring of every Kubernetes deployed application and the clusters they are deployed to",
                    "Built-in canary and incremental deployment strategies with automatic canary metric collection and display",
                    "Active contributor to the future of cloud native technologies (through the Cloud Native Computing Foundation)"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Faster time to market through the adoption of Kubernetes",
                        "Increased application scalability and resiliency"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Streamlined, cloud-native toolchain",
                        "Lifting and shifting from on-prem to the cloud",
                        "Reduced learning curve and time to developer productivity"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Reduce the technical and operational risk of migrating to the cloud",
                        "Curated integrations with graduated CNCF projects reduces risk of adoption",
                        "Reduced unsuccessful deployments (canary, incremental, etc.)",
                        "Reduced downtime due to cloud failover capabilities",
                        "Reduced MTTR (mean time to resolution)"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - Ticketmaster | Problem: Slow build process prevented innovation | Solution: GitLab Premium (CI) | Result:  15x faster - from over 2 hours to 8 minute builds; faster releases and better customer experiences (5 star app reviews)",
                    "SMB - Cloud Native Computing Foundation | Problem: Needed new features in GitLab to meet their business and technical needs | Solution: GitLab CE | Result: Modified their version of GitLab to meet their specific requirements",
                    "SMB - Wag! | Problem: Slow release process taking over 40 minutes | Solution: GitLab Ultimate (CI, CD) | Result: Release process reduced to 6 minutes; 8 releases per day with built-in security; a full deployment pipeline, to Amazon Elastic Container Service (ECS)",
                    "CNCF - The Cloud Native Computing Foundation uses GitLab to build, deploy and test CNCF key projects Prometheus, CoreDNS and Kubernetes itself",
                    "Gartner | 2019 Hype Cycle for DevOps | GitLab helped to define the market and is included as a relevant vendor for Toolchain, Toolchain Orchestration and Application Release Orchestration"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Kubernetes. Describe your Kubernetes strategy. How do you plan to operationalize that? What challenges do you expect to arise during that process? How would your teams benefit if they could deploy to Kubernetes easily? ",
                    "Trap = Additional Cloud Native Technologies. What additional cloud native technologies are you deploying? How does your current toolset support these technologies? What are some of the negative consequences if they are not supported?",
                    "Trap = No Cloud Native Strategy. Describe your current cloud native strategy. What is keeping you from adopting cloud native strategies? What are the pain points around your current IT operations? How does that affect release times?"
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "End-to-End Insight and Visibility",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Common data model uniquely allows for insights across the entire DevSecOps lifecycle",
                    "Configurable insights dashboard that shows status of work items over time",
                    "Cycle analytics data helps identify areas of improvement of cycle times",
                    "Security insights provide a roll-up of vulnerabilities",
                    "Program level insights help keep projects on-track"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Improved decision making leads to faster development cycle times and increased throughput",
                        "Improved visibility leads to organizational agility to respond to market trends and shifts"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Quickly identify and solve process bottlenecks",
                        "More efficient allocation of resources",
                        "Identify quality and security issues faster, reducing rework cost"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Quickly identify and fix security risks",
                        "Improved visibility into code quality"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - Equinix | Problem: Legacy developer tools prevented faster delivery | Solution: GitLab | Result: Consistent code reviews; visibility across the SDLC",
                    "Forrester | 2018 New Wave Value Stream Management- Strong Performer | Value stream management provides visibility into project planning, health indicators and analytics to remove waste and focus on customer value. ",
                    "Gartner | 2019 Enterprise Agile Planning Tools - Visionary | Agile planning tools help scale agile development practices, encouraging collaboration and faster delivery to respond to customer needs. ",
                    "G2 Crowd - 2018 | G2 Crowd Leader | Over 170 public reviews with a 4.4 rating - “Powerful team collaboration tool for managing software development projects”,  “GitLab is a great application for full Development Cycle. GitLab also provides a great dashboard.”"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Visibility. Describe your level of insight into your product development lifecycle today. What visibility or insights does your leadership have or need? What is your process for collecting this information? How would you benefit if you were able to see all this data and insights quickly and in a single location? ",
                    "Trap = Right Type of Data to Make Decisions. Walk me through your process for making decisions around resourcing and processes. How do you know where your release cycle currently is? As you look at your software development lifecycle, how do you identify bottlenecks? How do your security vulnerabilities affect your cycle time? How do you make decisions on where to make investments and improvements?"
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Flexible GitLab Hosting Options",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Use in the cloud or install in your own environment (cloud or on-prem)",
                    "Feature parity between GitLab.com and self-managed",
                    "Migrate from one hosting option to another when needs change",
                    "Implement hybrid hosting models to support scaling (like CI Runners in the cloud)",
                    "Easy to upgrade and maintain in any environment"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Scales easily as you grow"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Reduces personnel and hardware costs",
                        "Uses the most cost-effective infrastructure for your organization",
                        "Allows flexibility in financial management (OPEX vs. CAPEX)"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Achieve the security and compliance policies your organization requires",
                        "Enables hosting strategy flexibility over time",
                        "Run in a secure, air-gapped environment"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "29 self-managed installation options in addition to SaaS (GitLab.com) | Customers have multiple choices about where and how to run GitLab",
                    "Bitrise | When BitRise surveyed 10,000 developers who build apps regularly on their platform, they found that 67% of self-managed apps prefer GitLab’s on-premise solution | GitLab available in both SaaS and self-hosted ",
                    "Anonymous Public Sector Customer | Problem: Traditionally have been years behind in upgrades | Solution: GitLab | Result: With monthly GitLab releases, they are now only two weeks behind rather that years behind ",
                    "G2 Crowd - 2018 | G2 Crowd Leader | Over 170 public reviews with a 4.4 rating - “Powerful team collaboration tool for managing software development projects”,  “Great self-hosted open-source source control system”, and “Perfect solution for cloud and on premise Devops tool”"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Self-Managed. Describe your company’s policies around how you must secure your application environment. If it is self-hosted, then how do you scale all of your tools? Describe the upgrade process. What are the challenges you face around upgrade compatibility across multiple tools? How would a single upgrade benefit your teams? ",
                    "Trap = Hosting Strategy. Walk me through your long-term hosting plans for your DevOps tools. If you needed to change that quickly, how difficult would that be? What if you could easily lift and shift to a different hosting option? ",
                    "Trap = Scalability. How does your current toolset scale? Are you able to leverage both on-prem and cloud resources? In high peak times, how easily are you able to scale up to satisfy demand? In the non-peak times, how much does that cost to maintain if you were unable to quickly scale down? If you could automate this process, how much time and money do you think you could save?"
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Rapid Innovation",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Releases every month, for 100+ months running",
                    "A constant stream of new features - GitLab gets more valuable over time",
                    "Uniquely transparent product development process; customers, partners and community can contribute"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Fastest path to achieving the benefits of DevOps",
                        "New features enable customers to move faster"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Remarkably simple upgrade process for self-managed customers",
                        "Broad feature set enables tool consolidation",
                        "Reduce cost/effort of cloud adoption due to GitLab’s optimizations for cloud-native technologies",
                        "Reduce the learning and adoption curve of new technologies like Kubernetes"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Enables continuous improvement and delivery/deployment"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "Deploys/day - Over 160 deploys/day on about.gitlab.com",
                    "Monthly releases - Over 8 years of consecutive monthly non-trivial releases",
                    "CNCF - 2017 | CNCF - The 30 Highest Velocity Open Source Projects | Developer velocity can help illuminate promising areas in which to get involved and what is likely to be the successful platforms over the next several years",
                    "IDC - 2019 | IDC Innovators: Tools Supporting Open (Unopinionated) Developer Platforms, 2019 | Demonstrated either a groundbreaking business model or an innovative new technology or both",
                    "G2 Crowd - 2018 | G2 Crowd Leader | Over 170 public reviews with a 4.4 rating - “Powerful team collaboration tool for managing software development projects”,  “GitLab is a great application for full Development Cycle. GitLab also provides a great dashboard.”",
                    "Contributors - over 2,300 active community code contributors",
                    "Contributions - Average 150 community contributions per month (in 2018); 200 community contributions in June 2019"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Pace of Innovation. Describe how your current vendors impact your speed of innovation. How does your toolchain enable a modern DevSecOps workflow? How are you ensuring your toolchain is evolving fast enough to meet your needs? How would a monthly release cycle benefit your team? ",
                    "Trap = Ease of Upgrade. Describe the current challenges with upgrading your current toolchain. What fails when you upgrade? What would the impact be if you could upgrade your DevOps toolchain more frequently?",
                    "Trap = Technology Adoption. Walk me through your plans for leveraging cloud native technology like Kubernetes. What  cloud native tech does your current toolchain support? How are you ensuring adoption of cloud native tech across your teams? How could your teams benefit if you had an onramp to tech like Kubernetes? "
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Open Source; Everyone Can Contribute",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "Open core development model allows anyone to contribute to the functionality of the product",
                    "Uniquely transparent product development process engaging customers, partners and the community",
                    "Strong and growing community - thousands of organizations and millions of users",
                    "Harness open source innovations within the product experience (eg. Prometheus)"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Adopt better tools faster through open source innovation (constant stream of new features, from 2200+ code contributors and the community)",
                        "Talent acquisition and retention (developers love GitLab)Talent acquisition and retention (developers love GitLab)"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Multiple customers can contribute code to solve similar problems, reducing the cost to any one single customer or vendor",
                        "Fast learning curve - millions of developers already have GitLab experience "
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Flexibility to add to the product as needed; not locked into feature set we choose to build",
                        "Widely used and adopted product at internet scale",
                        "Reduced risk of technology obsolescence because of a vibrant community",
                        "Ability to get support as needed"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - Siemens | Problem:  Needed to improve and enhance their developer tools| Solution: GitLab Premium (CI) | Result: Actively contributing to GitLab project with upstream commits",
                    "SMB - Cloud Native Computing Foundation| Problem: Needed new features in GitLab to meet their business and technical needs | Solution: GitLab CE  | Result: Modified their version of GitLab to meet their specific requirements",
                    "CNCF - 2017 | CNCF - The 30 Highest Velocity Open Source Projects | Developer velocity can help illuminate promising areas in which to get involved, and what is likely to be the successful platform over the next several years.",
                    "Axo Soft - 2019 | Axo Soft - Top 20 Dev Tools for 2019 | GitLab is one of the most popular developer tools",
                    "NAIC -  NAIC Contributor - blog | Problem: NAIC identified a need for specific functionality in GitLab | Result:  GitLab team collaborated and enabled the community contribution of new features into GitLab",
                    "Contributors - Over 2,300 active community code contributors",
                    "Community - Over 11% of product commits come from the community (7800 commits in the last 12 months)"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Vendor Influence. How are you currently collaborating with your vendors in your toolchain? Describe the level of visibility you have into your vendors’ roadmaps. How would you benefit from the ability to influence the roadmap of your current vendors? ",
                    "Trap = Open Source Commitment. Walk me through your initiatives for adopting open source. Describe the benefits you see as a company of adopting open source. What’s the impact of not adopting open source?",
                    "Trap = Open Source Contribution. Describe your engineers level of participation in open source projects for the company’s benefit. How would it impact your DevOps toolchain if your engineers could make changes directly to the product?",
                  "Trap = Employee Retention.  How challenging is it to recruit and retain development talent? How important is it for your developers to be working with the latest modern technologies? Explain how your tech stack has had an impact on your recruiting and retention. What challenges do developers have with your current toolchain? How would it impact your business if you could improve developer retention?"
                  ]
                },
                "child": "null"
              }
            ]
          },
          {
            "value": "Collaborative and Transparent Customer Experience",
            "desc": {
              "value": []
            },
            "child": [
              {
                "value": "Description",
                "desc": {
                  "value": [
                    "We operationalize our core values into how we develop our product and engage with our community and customers",
                    "Extreme transparency around roadmaps, issues, company meetings and processes",
                    "We use GitLab for collaborating with customers in a transparent way, for both issue resolution and roadmap iteration",
                    "GitLab provides an evolving case study of DevSecOps and agile practices at scale, accessible through the public handbook"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Costumer Value",
                "desc": {
                  "value": []
                },
                "child": [
                  {
                    "value": "↑ revenue:",
                    "desc": {
                      "value": [
                        "Collaboration allows customers to influence features they need to innovate and generate revenue faster"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ cost:",
                    "desc": {
                      "value": [
                        "Learn from and leverage GitLab’s best practices to shorten the journey to DevSecOps",
                        "Collaborative and transparent relationship with GitLab enables faster resolution of issues"
                      ]
                    },
                    "child": "null"
                  },
                  {
                    "value": "↓ risk: ",
                    "desc": {
                      "value": [
                        "Transparency creates trust with GitLab and you can plan and execute accordingly"
                      ]
                    },
                    "child": "null"
                  }
                ]
              },
              {
                "value": "Defensibility",
                "desc": {
                  "value": [
                    "ENT - Siemens | Problem: Needed to improve and enhance their developer tools | Solution: GitLab Premium (CI) | Result: Actively contributing to GitLab project with upstream commits",
                    "SMB - Cloud Native Computing Foundation | Problem: Needed new features in GitLab to meet their business and technical needs | Solution: GitLab CE | Result: Modified their version of GitLab to meet their specific requirements",
                    "Active community - Average 150 community contributions per month (2018); 200 community contributions in June 2019. Fueled by a community of over 10,000 contributing users, customers and advocates"
                  ]
                },
                "child": "null"
              },
              {
                "value": "Trap-Setting Questions",
                "desc": {
                  "value": [
                    "Trap = Influence Transparent Product Roadmap. Describe the level of insight you have into your current vendor’s roadmap. What type of influence do you have on that roadmap? How consistent is your vendor in delivering what they promised? How would that impact your business decisions if you had visibility and influence into your vendor’s roadmap? ",
                    "Trap = Collaboration with Customer Success and Support. Describe your overall engagement with your current vendors. What is your level of satisfaction with their support? How invested are they in your success? ",
                    "Trap = Operationalize GitLab Values. When you talk about DevOps, many people talk about the importance of culture. What are you doing to change and improve your culture? What are the challenges you are facing? Would it be valuable for you to work with a company that is transparent about everything (e.g. processes, culture, etc.)?"
                  ]
                },
                "child": "null"
              }
            ]
          }
        ]
      }
    ]
  }
}